from typing import Final


GREETING_MESSAGE: Final[str] = (
    'Привет, я бот, который сможет помочь тебе, если ты потерял или нашел питомца, '
    'а также если только планируешь им обзавестись'
)

MAIN_KEYBOARD_MESSAGE: Final[str] = 'Что тебя интересует?'

PET_MISSING_NOTICES_MESSAGE: Final[str] = 'На сегодняшний день эти питомцы считаются потерянными'

PET_FOUND_NOTICES_MESSAGE: Final[str] = 'Держи список найденных животных'

PET_ADOPTION_NOTICES_MESSAGE: Final[str] = 'Свой дом ищут эти питомцы'

PERSONAL_ACCOUNT_MESSAGE: Final[str] = 'Здесь доступен следующий функционал личного кабинета'

CALLBACK_ANSWER_MESSAGE: Final[str] = 'Секунду...'

NO_NOTICES_MESSAGE: Final[str] = 'Пока нет объявлений 😔'
